{
  "title": "culture-benefits",
  "content": "We are a technology house headquartered in Berlin, Germany, with engineering hubs in Novi Sad, Banja Luka, Doboj, and Lisbon. Our mission is to deliver custom-made digital products that enable our customers to be efficient, effective, and real digital champions. We take pride in our end-to-end product development approach, from prototype to delivery. Our expertise is the delivery of your digital nervous system for web development, APIs, mobile development, or any other business provider. We do this by creating an environment where our team can reach their full potential. We have experts in modern technologies and tools and 12+ years of experience from countless successful projects with prominent companies.  Our full-time team has over 125 incredibly talented engineers, UX/UI designers, and product managers. We’re growing and expanding our tech stack and product capabilities but never lose our focus on our people. Company benefits are a crucial part of an employee's compensation, contributing to their job satisfaction and overall well-being. At productdock, we offer valuable benefits. Private Health Insurance: Comprehensive coverage including medical, and dental healthcare. European Voluntary Pension Fund: A retirement savings opportunity with tax-free contributions, supporting employees' savings and securing long-term financial security. Hybrid work environment: Employees can work both in the office and remotely. 27 Vacation Days: Generous vacation policy allowing individuals to prioritize personal time, travel, and relaxation. Education Budget: An allocated budget for continuous learning, attending conferences, taking online courses, or relevant certifications. Monthly Benefits: Personalized perks like recreation memberships, wellness stipends, and hobby coupons. The specific regulations for the benefits model may vary across different offices, as they are based on the office organization. For more specific details, please consult your Unit Lead or refer to the employee handbook - https://coda.io/d/ProductDocks-Employee-Handbook_dPK-RdomQts/About-PD_suapd#_lu-7z",
  "docsUrl": "https://coda.io/d/ProductDocks-Employee-Handbook_dPK-RdomQts/About-PD_suapd#_lu-7z"
}
